results/pro6000_l40s_h100_h200_11_2025/output-heavy/pro6000_x_8_zai-org_GLM-4.6-FP8_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     1024      
Maximum request concurrency:             256       
Benchmark duration (s):                  1125.71   
Total input tokens:                      102318    
Total generated tokens:                  1945600   
Request throughput (req/s):              0.91      
Output token throughput (tok/s):         1728.34   
Peak output token throughput (tok/s):    2304.00   
Peak concurrent requests:                443.00    
Total Token throughput (tok/s):          1819.23   
---------------Time to First Token----------------
Mean TTFT (ms):                          3297.22   
Median TTFT (ms):                        3165.04   
P99 TTFT (ms):                           7194.08   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          146.41    
Median TPOT (ms):                        146.39    
P99 TPOT (ms):                           147.57    
---------------Inter-token Latency----------------
Mean ITL (ms):                           146.63    
Median ITL (ms):                         146.33    
P99 ITL (ms):                            158.64    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          281327.75 
Median E2EL (ms):                        280962.35 
P99 E2EL (ms):                           283947.94 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0', '1', '2', '3', '4', '5', '6', '7']
              capabilities: [gpu]
    volumes:
      - /media/cloudrift/hf_models:/media/cloudrift/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/media/cloudrift/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 8
      --pipeline-parallel-size 1
      --model /media/cloudrift/hf_models/zai-org/GLM-4.6-FP8
      --served-model-name zai-org/GLM-4.6-FP8
      --tool-call-parser glm45 --reasoning-parser glm45 --max-num-seqs 256 --max-model-len 8192 --kv-cache-dtype fp8
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /media/cloudrift/hf_models:/media/cloudrift/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - HF_HOME=/media/cloudrift/hf_models
      - CUDA_VISIBLE_DEVICES=""
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model zai-org/GLM-4.6-FP8     --dataset-name random     --random-input-len 100     --random-output-len 1900     --max-concurrency 256     --num-prompts 1024     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://vllm_0:8000
==================================================